# Homebrew bundle for a fresh Apple Silicon macOS development machine.

brew "bash"
brew "cmake"
brew "coreutils"
brew "curl"
brew "eza"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "grep"
brew "jq"
brew "neovim"
brew "ninja"
brew "pinentry-mac"
brew "pkgconf"
brew "rustup"
brew "tmux"
brew "tree-sitter"
brew "uv"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "font-meslo-lg-nerd-font"
cask "google-chrome"
cask "ghostty"
cask "iterm2"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "visual-studio-code"
